// ------------------------------------------------------------------------
// Main Window
// ------------------------------------------------------------------------
"Fax Settings"="Fax Settings";
"Back"="Back";
"Str_Fax_Settings_Btn_Next"="Next";
"Str_Fax_Settings_Btn_Finish"="Finish";

// ------------------------------------------------------------------------
// Introduction
// ------------------------------------------------------------------------
"Str_Introduction_View_Title"="Introduction";
"Make the basic settings to send/receive faxes."="Make the basic settings to send/receive faxes.";
"Make sure that the computer is connected to the printer, the printer driver is installed, setup for printing from the computer is finished, and the printer is turned on."="Make sure that the computer is connected to the printer, the printer driver is installed, setup for printing from the computer is finished, and the printer is turned on.";

// ------------------------------------------------------------------------
// Progress Message(read setting information)
// ------------------------------------------------------------------------
"Str_Read_Information_Progress_Message"="Reading settings from the printer.";

// ------------------------------------------------------------------------
// Header Information Settings
// ------------------------------------------------------------------------
"Str_Header_Information_Strings_View_Title"="Header Information Settings";
"Enter your Fax Header and Phone Number."="Enter your Fax Header and Phone Number.";
"Fax Header:"="Fax Header:";
"Your Phone Number:"="Your Phone Number:";
"Your Fax Header and Phone Number are displayed at the top of the received fax."="Your Fax Header and Phone Number are displayed at the top of the received fax.";

// ------------------------------------------------------------------------
// Auto Answer Settings
// ------------------------------------------------------------------------
"Str_Auto_Answer_Strings_View_Title"="Auto Answer Settings";
"If you use the Fax more than the Printer, we recommend using Auto Answer. We also recommend keeping paper for fax reception loaded at all times."="If you use the Fax more than the Printer, we recommend using Auto Answer. We also recommend keeping paper for fax reception loaded at all times.\nNote:\nThe Rings to Answer setting may be unavailable depending on the region.";
"Number of Rings to Answer:"="Number of Rings to Answer:";
"Make sure you set Auto Answer if there is no external telephone connected to the printer.\nFaxes cannot be received if Auto Answer is not set."="Make sure you set Auto Answer if there is no external telephone connected to the printer.\nFaxes cannot be received if Auto Answer is not set.";
"Auto Answer"="Auto Answer";
"Str_Auto_Answer_Strings_Button_On"="Auto Answer:On";
"Str_Auto_Answer_Strings_Button_Off"="Auto Answer:Off";
"Str_Auto_Answer_Strings_Button_AutoSwitch"="Fax/Tel Auto Switch";

// ------------------------------------------------------------------------
// Dial Tone Detection Settings
// ------------------------------------------------------------------------
"Str_Dial_Tone_Detection_Settings_View_Title"="Dial Tone Detection Settings";
"Set whether or not to start dialing after detecting a dial tone."="Set whether or not to start dialing after detecting a dial tone.";
"If a dial tone cannot be detected by the Check Fax Connection, you can dial by clearing the check box."="If a dial tone cannot be detected by the Check Fax Connection, you can dial by turning off the check box.";
"Sometimes, clearing the check box might remove part of the number, and you might connect to the wrong number."="Sometimes, turning off the check box might remove part of the number, and you might connect to the wrong number.";
"Detect Dial Tone"="Detect Dial Tone";

// ------------------------------------------------------------------------
// Confirm Settings
// ------------------------------------------------------------------------
"Str_Confirm_Settings_View_Title"="Confirm Settings";
"Check the following settings."="Check the following settings.";
"Click [Next] to send the setting information to the printer."="Click [Next] to send the settings to the printer.";
"Str_Confirm_Settings_View_SText_Fax_Header"="Fax Header:";
"Str_Confirm_Settings_View_SText_Phone_Number"="Your Phone Number:";
"Str_Confirm_Settings_View_SText_Auto_Answer"="Auto Answer:";
"Str_Confirm_Settings_View_SText_Rings_To_Answer"="Rings to Answer:";
"Str_Confirm_Settings_View_SText_Dial_Tone_Detection"="Dial Tone Detection:";
"Str_Confirm_Settings_View_SText_On"="On";
"Str_Confirm_Settings_View_SText_Off"="Off";
"Str_Confirm_Settings_View_SText_AutoSwitch"="Auto Switch";

// ------------------------------------------------------------------------
// Progress Message(write settings information)
// ------------------------------------------------------------------------
"Str_Write_Information_Progress_Message"="Sending settings to the printer.";

// ------------------------------------------------------------------------
// Settings Complete
// ------------------------------------------------------------------------
"Str_Settings_Complete_View_Title"="Settings Complete";
"Str_Settings_Complete_View_SText_Success"="Fax Settings completed normally.";

// ------------------------------------------------------------------------
// Failed to make Fax Settings
// ------------------------------------------------------------------------
"Str_Failed_Make_Fax_Settings_View_Title"="Failed to make Fax Settings";

// ------------------------------------------------------------------------
// Menu
// ------------------------------------------------------------------------
"FAX Utility"="FAX Utility";
"About FAX Utility..."="About FAX Utility...";
"Preferences..."="Preferences...";
"Services"="Services";
"Hide FAX Utility"="Hide FAX Utility";
"Hide Others"="Hide Others";
"Show All"="Show All";
"Quit FAX Utility"="Quit FAX Utility";
"File"="File";
"Close"="Close";
"Edit"="Edit";
"Undo"="Undo";
"Redo"="Redo";
"Cut"="Cut";
"Copy"="Copy";
"Paste"="Paste";
"Delete"="Delete";
"Select All"="Select All";
"Window"="Window";
"Minimize"="Minimize";
"Help"="Help";

// ------------------------------------------------------------------------
// Alert(Common)
// ------------------------------------------------------------------------
"Str_Alert_Common_Cancel"="Cancel";
"Str_Alert_Common_OK"="OK";

"Str_Alert_Common_Necessary_File_Not_Found"="Cannot find the necessary file to execute the application.\nReinstall FAX Utility.";
"Str_Alert_Common_Cannot_Get_Printer_Information"="Unable to obtain printer (fax) information. Open \"Print & Fax Preferences\" and add the PC-FAX driver.";
"Str_Alert_Common_Confirm_OverWrite"="The file specified already exists. Do you want to overwrite?";
"Str_Alert_Common_Not_Responding_Error"="The printer is not responding. Make sure the printer is connected correctly and the power is on.";
"Str_Alert_Common_Communication_Error"="A printer communication error occurred.";
"Str_Alert_Common_Printer_Processing_Error"="The printer is processing data. Wait for a while and then try again.";
"Str_Alert_Common_Communication_Error_With_ErrorCode"="An error was detected while communicating with the printer.\nError Code (%d)";
"Str_Alert_Common_Error_Occurred"="Processing canceled because an error occurred.";
"Str_Alert_Common_PrinterStatusError"="An error occurred in the printer. Clear the error and then try again.";

// ------------------------------------------------------------------------
// Alert(FAX Settings)
// ------------------------------------------------------------------------
"Str_Alert_Fax_Settings_Cannot_Open"="Cannot start Fax Settings because another FAX Utility function is already running. Please wait until it has finished and try again.";
"Str_Alert_Fax_Settings_Confirm_Cancel_Processing"="Fax settings not complete.\nDo you want to cancel processing?";
"Str_Alert_Fax_Settings_Input_FaxHeader_Not_Support"="Only alphanumeric characters and symbols can be used for a Fax Header.";
"Str_Alert_Fax_Settings_Input_PhoneNumber_Not_Support"="Only numerical characters and spaces can be used for Your Phone Number.";
"Str_Alert_Fax_Settings_Input_RetryCount_Not_Support"="Set the Number of Rings to Answer within the %d to %d range.";
"Str_Alert_Fax_Settings_Setting_Information_Failed"="A problem was found in the settings acquired from the printer.\nItem name: (Item detected)";
